tap "achannarasappa/tap"
tap "adembc/tap"
tap "danvergara/tools"
tap "dart-lang/dart"
tap "dhth/tap"
tap "gromgit/brewtils"
tap "hashicorp/tap"
tap "jandedobbeleer/oh-my-posh"
tap "jbangdev/tap"
tap "jonas-grgt/ktea"
tap "localstack/tap"
tap "lusingander/tap"
tap "mongodb/brew"
tap "nakabonne/ali"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "snyk/tap"
tap "supabase/tap"
tap "theboredteam/boring-notch"
tap "valkyrie00/bbrew"
tap "zackelia/formulae"
tap "zackriya-solutions/meetily"
brew "openssl@3"
brew "protobuf"
brew "gmp"
brew "gcc"
brew "archgw"
brew "aria2"
brew "atac"
brew "atuin"
brew "node", link: false
brew "aws-amplify", link: false
brew "aws-cdk"
brew "aws-elasticbeanstalk"
brew "aws-sam-cli"
brew "aws-vault", link: false
brew "awscli"
brew "localstack"
brew "awscli-local"
brew "awslogs"
brew "axel"
brew "bat"
brew "bitwarden-cli"
brew "btop"
brew "certbot"
brew "cloc"
brew "cmake"
brew "ripgrep"
brew "codex"
brew "couchdb"
brew "csvlens"
brew "ctop"
brew "curlie"
brew "deno"
brew "diff-so-fancy"
brew "difftastic"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "doggo"
brew "dua-cli"
brew "duckdb"
brew "entr"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "forgit"
brew "gdrive"
brew "ggh"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "glow"
brew "go"
brew "gpg-tui"
brew "libpq"
brew "harlequin"
brew "helix"
brew "helm"
brew "httpie"
brew "hyperfine"
brew "imagemagick"
brew "iperf3"
brew "jless"
brew "jq"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "lazyjournal"
brew "lazysql"
brew "lima"
brew "mcpm"
brew "micro"
brew "minikube"
brew "mise"
brew "mongodb-atlas-cli"
brew "mprocs"
brew "mpv"
brew "mypy"
brew "n8n-mcp"
brew "nano"
brew "neovim"
brew "nginx"
brew "nmap"
brew "ntfy"
brew "nushell"
brew "nvm"
brew "ollama"
brew "opencode"
brew "openjdk@21"
brew "p7zip"
brew "pandoc"
brew "tree"
brew "pass"
brew "pipx"
brew "pnpm", link: false
brew "poetry"
brew "poppler"
brew "postgresql@14"
brew "postgresql@16"
brew "python@3.12"
brew "rain"
brew "rainfrog"
brew "rclone"
brew "redis@6.2"
brew "rich-cli"
brew "rmlint"
brew "rsync"
brew "rust"
brew "sbt"
brew "scrcpy"
brew "sevenzip"
brew "snyk-cli"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "stu"
brew "stylua"
brew "tabiew"
brew "tcpdump"
brew "tealdeer"
brew "television"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "uv"
brew "vegeta"
brew "wget"
brew "xclip"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zplug"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "achannarasappa/tap/ticker"
brew "adembc/tap/lazyssh"
brew "danvergara/tools/dblab"
brew "dhth/tap/cueitup"
brew "hashicorp/tap/terraform"
brew "jonas-grgt/ktea/ktea"
brew "lusingander/tap/ddv"
brew "oven-sh/bun/bun"
brew "valkyrie00/bbrew/bbrew"
cask "activitywatch"
cask "android-platform-tools"
cask "aws-vault-binary"
cask "bitwarden"
cask "boring-notch"
cask "chatgpt"
cask "claude"
cask "container"
cask "docker-desktop"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "ngrok"
cask "tradingview"
cask "visual-studio-code"
vscode "catppuccin.catppuccin-vsc"
vscode "divyanshuagrawal.competitive-programming-helper"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "pkief.material-icon-theme"
vscode "wakatime.vscode-wakatime"
go "github.com/keidarcy/e1s/cmd/e1s"
