tap "achannarasappa/tap"
tap "adembc/tap"
tap "antoniorodr/cronboard"
tap "auth0/auth0-cli"
tap "bellicose100xp/tap"
tap "bgreenwell/xleak"
tap "clevercloud/misc"
tap "danvergara/tools"
tap "dart-lang/dart"
tap "dhth/tap"
tap "dlvhdr/formulae"
tap "f/mcptools"
tap "f/textream"
tap "gromgit/brewtils"
tap "hashicorp/tap"
tap "huseyinbabal/tap"
tap "jandedobbeleer/oh-my-posh"
tap "jbangdev/tap"
tap "jonas-grgt/ktea"
tap "jstkdng/programs"
tap "jundot/omlx", "https://github.com/jundot/omlx"
tap "kaushiksrini/parqeye"
tap "kdash-rs/kdash"
tap "keidarcy/tap"
tap "kontext-security/tap"
tap "kriuchkov/tap"
tap "krtirtho/apps"
tap "lazynop/tap"
tap "legostin/tap"
tap "localstack/tap"
tap "lusingander/tap"
tap "maniacsan/torrra"
tap "markmarkoh/lt"
tap "metalbear-co/mirrord"
tap "mongodb/brew"
tap "nakabonne/ali"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "owloops/tap"
tap "rebelice/tap"
tap "skardyy/mcat"
tap "snyk/tap"
tap "steipete/tap"
tap "supabase/tap"
tap "terminaltrove/tap"
tap "theboredteam/boring-notch"
tap "tokuhirom/tap"
tap "tw93/tap"
tap "unhappychoice/tap"
tap "valkyrie00/bbrew"
tap "withgraphite/tap"
tap "yakitrak/yakitrak"
tap "zackelia/formulae"
tap "zackriya-solutions/meetily"
brew "openssl@3"
brew "protobuf"
brew "llvm"
brew "archgw"
brew "aria2"
brew "atac"
brew "node"
brew "aws-amplify"
brew "aws-sam-cli"
brew "aws-vault"
brew "awscli"
brew "awslogs"
brew "azure-cli"
brew "bat"
brew "bitwarden-cli"
brew "block-goose-cli"
brew "btop"
brew "carapace"
brew "certbot"
brew "chafa"
brew "cinecli"
brew "cloc"
brew "cloudflared"
brew "cmake"
brew "lima"
brew "colima"
brew "container", link: false
brew "copier"
brew "copilot"
brew "gmp"
brew "coreutils"
brew "cot"
brew "couchdb"
brew "csvlens"
brew "ctop"
brew "decompose"
brew "deno"
brew "devcockpit"
brew "diff-so-fancy"
brew "difftastic"
brew "direnv"
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-debug"
brew "doggo"
brew "dolphie"
brew "dry"
brew "dua-cli"
brew "entr"
brew "eza"
brew "fabric-ai"
brew "fastfetch"
brew "fd"
brew "felinks"
brew "ffmpeg"
brew "gcc"
brew "fzf"
brew "forgit"
brew "gdrive"
brew "gemini-cli", link: false
brew "gh"
brew "git"
brew "git-cliff"
brew "git-delta"
brew "git-flow-next"
brew "git-lfs"
brew "git-secret"
brew "gitleaks"
brew "glow"
brew "go"
brew "gpg-tui"
brew "grex"
brew "libpq"
brew "harlequin"
brew "helix"
brew "helm"
brew "httpie"
brew "hyperfine"
brew "imagemagick"
brew "instaloader"
brew "intelli-shell"
brew "iperf3"
brew "jj"
brew "jless"
brew "jq"
brew "jrnl"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "lazycontainer"
brew "lazydocker"
brew "lazygit"
brew "lazyjournal"
brew "lazysql"
brew "libmicrohttpd"
brew "libpostal"
brew "lighttpd"
brew "lima-additional-guestagents"
brew "lld"
brew "llmfit"
brew "locust"
brew "luarocks"
brew "mermaid-cli"
brew "micro"
brew "minikube"
brew "mise"
brew "mongodb-atlas-cli"
brew "mprocs"
brew "mpv"
brew "mypy"
brew "tree-sitter"
brew "neovim"
brew "nginx"
brew "nmap"
brew "ntfy"
brew "nushell"
brew "nvm"
brew "oha"
brew "ollama"
brew "openai-whisper"
brew "openjdk"
brew "openapi-generator"
brew "ripgrep"
brew "opencode"
brew "openjdk@21"
brew "optipng"
brew "p7zip"
brew "pandoc"
brew "tree"
brew "pass"
brew "pgrok"
brew "pgvector"
brew "pipx"
brew "pngquant"
brew "pnpm"
brew "poetry"
brew "poppler"
brew "postgresql@17", restart_service: :changed, link: true
brew "pulumi"
brew "python@3.12"
brew "python@3.9"
brew "qwen-code"
brew "rainfrog"
brew "rclone"
brew "redis"
brew "redis@6.2", restart_service: :changed
brew "rich-cli"
brew "rmlint"
brew "rsync"
brew "rtk"
brew "rust"
brew "sbt"
brew "scrcpy"
brew "sentry-cli"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "snyk-cli"
brew "sonar-scanner"
brew "speedtest-cli"
brew "starship"
brew "stow"
brew "stu"
brew "stylua"
brew "subversion"
brew "summarize"
brew "tabiew"
brew "tcpdump"
brew "tcpkali"
brew "tealdeer"
brew "tectonic"
brew "television"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "timewarrior"
brew "tmux"
brew "trash"
brew "ttyd"
brew "uv"
brew "vegeta"
brew "viu"
brew "wget"
brew "worktrunk"
brew "xclip"
brew "yazi"
brew "yq"
brew "zellij"
brew "zig"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "achannarasappa/tap/ticker"
brew "adembc/tap/lazyssh"
brew "antoniorodr/cronboard/cronboard"
brew "auth0/auth0-cli/auth0"
brew "bellicose100xp/tap/jiq"
brew "bgreenwell/xleak/xleak"
brew "danvergara/tools/dblab"
brew "dhth/tap/cueitup"
brew "dlvhdr/formulae/diffnav"
brew "f/mcptools/mcp"
brew "gromgit/brewtils/taproom"
brew "hashicorp/tap/terraform"
brew "huseyinbabal/tap/taws"
brew "jonas-grgt/ktea/ktea"
brew "jstkdng/programs/ueberzugpp"
brew "kaushiksrini/parqeye/parqeye"
brew "kdash-rs/kdash/kdash"
brew "keidarcy/tap/e1s"
brew "kontext-security/tap/kontext"
brew "kriuchkov/tap/tock"
brew "lazynop/tap/lazyenv"
brew "legostin/tap/cull"
brew "lusingander/tap/ddv"
brew "markmarkoh/lt/lt"
brew "metalbear-co/mirrord/mirrord"
brew "oven-sh/bun/bun"
brew "owloops/tap/tfjournal"
brew "rebelice/tap/lazypg"
brew "steipete/tap/mcporter"
brew "terminaltrove/tap/moltbook-tui"
brew "tokuhirom/tap/dcv"
brew "unhappychoice/tap/gitlogue"
brew "valkyrie00/bbrew/bbrew"
brew "withgraphite/tap/graphite"
brew "yakitrak/yakitrak/obsidian-cli"
cask "apidog"
cask "aws-vault-binary"
cask "bitwarden"
cask "theboredteam/boring-notch/boring-notch"
cask "chatgpt"
cask "container"
cask "docker-desktop"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "ngrok"
cask "notion"
cask "qbittorrent"
cask "tablepro"
cask "telegram"
cask "temurin"
cask "f/textream/textream"
cask "visual-studio-code"
cask "wallspace"
cask "zo"
vscode "catppuccin.catppuccin-vsc"
vscode "divyanshuagrawal.competitive-programming-helper"
vscode "eamodio.gitlens"
vscode "kilocode.kilo-code"
vscode "openai.chatgpt"
vscode "vscodevim.vim"
go "github.com/keidarcy/e1s/cmd/e1s"
go "github.com/nlamirault/e2c/cmd/e2c"
go "github.com/projectdiscovery/katana/cmd/katana"
go "github.com/nnnkkk7/lazyactions/cmd/lazyactions"
go "github.com/jesseduffield/lazynpm"
go "github.com/unkn0wn-root/resterm/cmd/resterm"
go "github.com/arpxspace/smartcommit"
go "github.com/Gaurav-Gosain/tuios/cmd/tuios"
cargo "octotype"
uv "awscli-local"
uv "cloctui"
uv "git-filter-repo"
uv "git-gud"
uv "harlequin"
uv "kaggle"
uv "llamactl"
uv "marimo"
uv "markitdown[all]"
uv "nano-pdf"
uv "pre-commit"
uv "pysonar"
uv "skill-seekers"
uv "sqlit-tui"
