tap "dart-lang/dart"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jbangdev/tap"
tap "mongodb/brew"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "supabase/tap"
tap "zackelia/formulae"
brew "aichat"
brew "ca-certificates"
brew "python@3.12"
brew "awscli"
brew "axel"
brew "bat"
brew "bitcoin"
brew "bottom"
brew "btop"
brew "cmake"
brew "cocoapods"
brew "deno"
brew "difftastic"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "dust"
brew "entr"
brew "eza"
brew "fastfetch"
brew "fd"
brew "gmp"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "go"
brew "gradle"
brew "helm"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "micro"
brew "midnight-commander"
brew "minikube"
brew "node"
brew "mongodb-atlas-cli"
brew "mprocs"
brew "mpv"
brew "neovim"
brew "nmap"
brew "nvm"
brew "ollama"
brew "openjdk@21"
brew "p7zip"
brew "pandoc"
brew "poetry"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "posting"
brew "protobuf"
brew "ripgrep"
brew "rust"
brew "sbt"
brew "sevenzip"
brew "starship"
brew "tcpdump"
brew "telnet"
brew "the_silver_searcher"
brew "thefuck"
brew "tlrc"
brew "uv"
brew "wget"
brew "xclip"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "dart-lang/dart/dart", link: false
brew "hashicorp/tap/terraform"
brew "mongodb/brew/mongodb-community"
brew "oven-sh/bun/bun"
brew "supabase/tap/supabase"
cask "bitcoin-core"
cask "flutter"
cask "ghostty"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "augment.vscode-augment"
vscode "betajob.modulestf"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "codezombiech.gitignore"
vscode "dannysteenman.aws-terraform-extension-pack"
vscode "dannysteenman.iam-actions-snippets"
vscode "dannysteenman.iam-service-principal-snippets"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "divyanshuagrawal.competitive-programming-helper"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.debug-visualizer"
vscode "kevinrose.vsc-python-indent"
vscode "mathematic.vscode-pdf"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "phplasma.csv-to-table"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "scala-lang.scala"
vscode "solidhelium.codeforces-submitter"
vscode "tamasfe.even-better-toml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "wakatime.vscode-wakatime"
vscode "ziyasal.vscode-open-in-github"
