tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
tap "jbangdev/tap"
tap "mongodb/brew"
tap "zackelia/formulae"
brew "ca-certificates"
brew "axel"
brew "bat"
brew "btop"
brew "python@3.12"
brew "cocoapods"
brew "colima"
brew "difftastic"
brew "direnv"
brew "docker"
brew "docker-compose"
brew "dust"
brew "entr"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "go"
brew "gradle"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "node"
brew "mailsy"
brew "midnight-commander"
brew "minikube"
brew "mongosh"
brew "mprocs"
brew "ncdu"
brew "neovim"
brew "netlify-cli"
brew "nmap"
brew "nvm"
brew "p7zip"
brew "pandoc"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "python@3.10"
brew "ripgrep"
brew "rust"
brew "sevenzip"
brew "starship"
brew "tcpdump"
brew "telnet"
brew "thefuck"
brew "tlrc"
brew "tmux"
brew "uv"
brew "vite"
brew "wget"
brew "xclip"
brew "yarn"
brew "yazi"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "dart-lang/dart/dart", link: false
cask "flutter"
cask "font-hack-nerd-font"
cask "wezterm"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "catppuccin.catppuccin-vsc"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "divyanshuagrawal.competitive-programming-helper"
vscode "fnando.linter"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "mathematic.vscode-pdf"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "solidhelium.codeforces-submitter"
vscode "tamasfe.even-better-toml"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "wakatime.vscode-wakatime"
vscode "wix.vscode-import-cost"
