tap "achannarasappa/tap", "https://github.com/achannarasappa/tap.git", trusted: true
tap "adembc/tap", "https://github.com/Adembc/homebrew-tap", trusted: true
tap "antoniorodr/cronboard", trusted: true
tap "auth0/auth0-cli", trusted: true
tap "bellicose100xp/tap", trusted: true
tap "bgreenwell/xleak", trusted: true
tap "chojs23/tap", trusted: true
tap "clevercloud/misc", "https://github.com/CleverCloud/homebrew-misc", trusted: true
tap "cockroachdb/tap", trusted: true
tap "danvergara/tools", trusted: true
tap "dart-lang/dart", trusted: true
tap "dhth/tap", trusted: true
tap "dlvhdr/formulae", trusted: true
tap "f/mcptools", trusted: true
tap "f/textream", trusted: true
tap "gromgit/brewtils", trusted: true
tap "hashicorp/tap", trusted: true
tap "huseyinbabal/tap", trusted: true
tap "jandedobbeleer/oh-my-posh", trusted: true
tap "jbangdev/tap", trusted: true
tap "jonas-grgt/ktea", trusted: true
tap "jstkdng/programs", trusted: true
tap "jundot/omlx", "https://github.com/jundot/omlx", trusted: true
tap "kaushiksrini/parqeye", trusted: true
tap "kdash-rs/kdash", trusted: true
tap "keidarcy/tap", trusted: true
tap "kilo-org/tap", "https://github.com/Kilo-Org/homebrew-tap", trusted: true
tap "kitlangton/tap"
tap "kontext-security/tap", trusted: true
tap "kriuchkov/tap", trusted: true
tap "krtirtho/apps", trusted: true
tap "lazynop/tap", trusted: true
tap "legostin/tap", trusted: true
tap "leohenon/tap"
tap "localstack/tap", trusted: true
tap "lusingander/tap", trusted: true
tap "manaflow-ai/cmux", trusted: true
tap "maniacsss/torrra", "https://github.com/Maniacsss/homebrew-torrra.git", trusted: true
tap "markmarkoh/lt", trusted: true
tap "metalbear-co/mirrord", trusted: true
tap "modem-dev/tap"
tap "mongodb/brew", trusted: true
tap "muesli-hq/muesli", "https://github.com/Muesli-HQ/homebrew-muesli.git"
tap "nakabonne/ali", trusted: true
tap "nikitabobko/tap", trusted: true
tap "nkzw-tech/tap", trusted: true
tap "nnnkkk7/tap"
tap "openclaw/tap", trusted: true
tap "oven-sh/bun", trusted: true
tap "owloops/tap", "https://github.com/Owloops/homebrew-tap", trusted: true
tap "rebelice/tap", trusted: true
tap "riii111/sabiql"
tap "s-sigdel/tap", "https://github.com/S-Sigdel/homebrew-tap", trusted: true
tap "skardyy/mcat", "https://github.com/Skardyy/homebrew-mcat", trusted: true
tap "snyk/tap", trusted: true
tap "steipete/tap", trusted: true
tap "supabase/tap", trusted: true
tap "tamnd/tap"
tap "terminaltrove/tap", trusted: true
tap "theboredteam/boring-notch", "https://github.com/TheBoredTeam/homebrew-boring-notch", trusted: true
tap "tokuhirom/tap", trusted: true
tap "tw93/tap", trusted: true
tap "unhappychoice/tap", trusted: true
tap "valkyrie00/bbrew", "https://github.com/Valkyrie00/homebrew-bbrew", trusted: true
tap "withgraphite/tap", trusted: true
tap "yakitrak/yakitrak", trusted: true
tap "zackelia/formulae", trusted: true
tap "zackriya-solutions/meetily", trusted: true
# Cryptography and SSL/TLS Toolkit
brew "openssl@3", link: false
# Download with resuming and segmented downloading
brew "aria2"
# Simple API client (Postman-like) in your terminal
brew "atac"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Multi-shell multi-command argument completer
brew "carapace"
# C access to FITS data files with optional Fortran wrappers
brew "cfitsio"
# GIF encoder written in C
brew "cgif"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Power of curl, ease of use of httpie
brew "curlie"
# Reverse-engineering tool for docker environments
brew "decompose"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# TUI system monitor for Apple Silicon
brew "devcockpit"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Use new container attach on already container go on debug
brew "docker-debug"
# Command-line DNS Client for Humans
brew "doggo"
# Feature-rich top tool for monitoring MySQL
brew "dolphie"
# Terminal application to manage Docker and Docker Swarm
brew "dry"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Text mode browser and Gemini, NNTP, FTP, Gopher, Finger, and BitTorrent client
brew "felinks"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interactive git commands in the terminal
brew "forgit"
# GNU compiler collection
brew "gcc"
# Google Drive CLI Client
brew "gdrive"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# High-velocity, monorepo-scale workflow for Git
brew "git-branchless"
# Highly customizable changelog generator
brew "git-cliff"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Modern implementation of the Git-flow branching model
brew "git-flow-next"
# Git extension for versioning large files
brew "git-lfs"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Audit git repos for secrets
brew "gitleaks"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Command-line tool for generating regular expressions
brew "grex"
# File format designed to store large amounts of data
brew "hdf5"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Agent multiplexer that lives in your terminal
brew "herdr"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Portable abstraction of the hierarchical topology of modern architectures
brew "hwloc"
# Command-line benchmarking tool
brew "hyperfine"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@77", link: true
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Download media from Instagram
brew "instaloader"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Git-compatible distributed version control system
brew "jj"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# TUI playground to experiment and play with jq
brew "jqp"
# Command-line note taker
brew "jrnl"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Terminal UI for Apple Containers
brew "lazycontainer"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Cross-platform TUI database management tool
brew "lazysql"
# DICOM WSI read library
brew "libdicom"
# EXIF parsing library
brew "libexif"
# Palette quantization library extracted from pnquant2
brew "libimagequant"
# C/C++ seam carving library
brew "liblqr"
# C library for reading and writing MATLAB MAT files
brew "libmatio"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Postgres C API library
brew "libpq"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# SIXEL encoder/decoder implementation
brew "libsixel"
# C library for reading and writing PNG format files
brew "libspng"
# GNOME XML library
brew "libxml2"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Small memory footprint, flexible web-server
brew "lighttpd"
# Additional guest agents for Lima
brew "lima-additional-guestagents"
# Find what models run on your hardware
brew "llmfit"
# Scalable user load testing tool written in Python
brew "locust"
# Package manager for the Lua programming language
brew "luarocks"
# Modern and intuitive terminal-based text editor
brew "micro"
# Run a Kubernetes cluster locally
brew "minikube"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Deep clean and optimize your Mac
brew "mole"
# Improved JPEG encoder
brew "mozjpeg"
# Run multiple commands in parallel
brew "mprocs"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Experimental optional static type checker for Python
brew "mypy"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Send push notifications to your phone or desktop via PUT/POST
brew "ntfy"
# Modern shell for the GitHub era
brew "nushell"
# Manage multiple Node.js versions
brew "nvm"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# High performance message passing library
brew "open-mpi"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@21", link: true
# C library to read whole-slide images (a.k.a. virtual slides)
brew "openslide"
# PNG file optimizer
brew "optipng"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Password manager
brew "pass"
# Poor man's ngrok, multi-tenant HTTP/TCP reverse tunnel solution
brew "pgrok"
# Open-source vector similarity search for Postgres
brew "pgvector"
# PNG image optimizing utility
brew "pngquant"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@17", link: true
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Cloud native development platform
brew "pulumi"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Utility that provides fast incremental file transfer
brew "rsync"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Safe, concurrent, practical language
brew "rust"
# Build tool for Scala projects
brew "sbt"
# Display and control your Android device
brew "scrcpy"
# Intuitive find & replace CLI
brew "sd"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Database of common MIME types
brew "shared-mime-info"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Scans and monitors projects for security vulnerabilities
brew "snyk-cli"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Super fast C++ logging library
brew "spdlog"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# TUI explorer application for Amazon S3 (AWS S3)
brew "stu"
# Opinionated Lua code formatter
brew "stylua"
# Version control system designed to be a better CVS
brew "subversion"
# Multi-modal AI tool to extract and summarize content
brew "summarize"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tabiew"
# TOML toolkit written in Rust
brew "taplo"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Command-line packet analyzer
brew "tcpdump"
# High performance TCP and WebSocket load generator and sink
brew "tcpkali"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# General purpose fuzzy finder TUI
brew "television"
# User interface to the TELNET protocol
brew "telnet"
# Command-line time tracking application
brew "timewarrior"
# Terminal multiplexer
brew "tmux"
# Find and download torrents without leaving your CLI
brew "torrra"
# CLI tool that moves files or folder to the trash
brew "trash"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# HTTP load testing tool and library
brew "vegeta"
# Your CLI home video recorder
brew "vhs"
# Image processing library
brew "vips"
# Simple terminal image viewer written in Rust
brew "viu"
# Internet file retriever
brew "wget"
# CLI for Git worktree management, designed for parallel AI agent workflows
brew "worktrunk"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Terminal stock ticker with live updates and position tracking
brew "achannarasappa/tap/ticker"
# A simple terminal UI for managing SSH connections.  
brew "adembc/tap/lazyssh"
# Interactive JSON query tool with real-time output
brew "bellicose100xp/tap/jiq"
# Terminal Excel viewer with interactive TUI, search, formulas, and export
brew "bgreenwell/xleak/xleak"
# A terminal user interface client for Discord
brew "chojs23/tap/concord"
# Command-line interface for interacting with MCP (Model Context Protocol) servers
brew "f/mcptools/mcp"
# Interactive TUI for Homebrew
brew "gromgit/brewtils/taproom"
# Terraform
brew "hashicorp/tap/terraform"
# Terminal UI for AWS
brew "huseyinbabal/tap/taws"
# Kafka Terminal UI
brew "jonas-grgt/ktea/ktea"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# Parquet viewer for the command line
brew "kaushiksrini/parqeye/parqeye"
# A fast and simple dashboard for Kubernetes written in Rust
brew "kdash-rs/kdash/kdash"
# e1s is a terminal application to simply browsing and manage AWS ECS resources, with a focus on Fargate. Inspired by k9s.
brew "keidarcy/tap/e1s"
# The AI coding agent built for the terminal.
brew "kilo-org/tap/kilo"
# Terminal UI for GitHub pull requests
brew "kitlangton/tap/ghui", trusted: true
# Identity, credentials, and governance for AI agents
brew "kontext-security/tap/kontext"
# Tock v1.9.8 is a simple timetracker for the command line
brew "kriuchkov/tap/tock"
# TUI for managing .env files
brew "lazynop/tap/lazyenv"
# OpenCode with Vim keybindings - AI coding assistant for the terminal
brew "leohenon/tap/ocv", trusted: true
# Terminal DynamoDB Viewer
brew "lusingander/tap/ddv"
# An unofficial TUI client for Linear.app issues
brew "markmarkoh/lt/lt"
# Connect your local process and your cloud environment
brew "metalbear-co/mirrord/mirrord"
# Desktop-inspired terminal diff viewer for agent-authored changesets
brew "modem-dev/tap/hunk", trusted: true
# A TUI to visualize and manage GitHub Actions
brew "nnnkkk7/tap/lazyactions", trusted: true
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Record Terraform runs with git context, timing, and resource events
brew "owloops/tap/tfjournal"
# A simple terminal UI for PostgreSQL
brew "rebelice/tap/lazypg"
# Fast, driver-less TUI to browse, query, and edit PostgreSQL databases
brew "riii111/sabiql/sabiql", trusted: true
# Terminal trainer that drills advanced Vim techniques in real vim/nvim
brew "s-sigdel/tap/vimhjkl"
# Model Context Protocol runtime and CLI generator
brew "steipete/tap/mcporter"
# A Git history screensaver - watch your code rewrite itself
brew "unhappychoice/tap/gitlogue"
# Modern TUI for managing Homebrew packages and casks on macOS and Linux
brew "valkyrie00/bbrew/bbrew"
brew "yakitrak/yakitrak/notesmd-cli", link: false
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault-binary"
# Desktop password and login vault
cask "bitwarden"
# Not so boring notch That Rocks 🎸🎶 
cask "theboredteam/boring-notch/boring-notch"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# OpenAI's coding agent that runs in your terminal
cask "codex"
cask "container"
# Offline voice-to-text dictation app with AI enhancement
cask "fluidvoice"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Clone any website for offline viewing, with the JavaScript stripped out
cask "tamnd/tap/kage", trusted: true
# Local-first dictation and meeting transcription
cask "muesli"
# App to write, plan, collaborate, and get organised
cask "notion"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Messaging app with a focus on speed and security
cask "telegram"
# Multimedia player
cask "vlc"
# Live wallpaper app
cask "wallspace"
# Torrent streaming application
cask "webtorrent"
cargo "octotype"
uv "cloctui"
uv "cocoindex"
uv "git-filter-repo"
uv "git-gud"
uv "graphifyy"
uv "huggingface-hub"
uv "kaggle"
uv "llamactl"
uv "marimo"
uv "markitdown[all]"
uv "mlx-lm"
uv "pgcli"
uv "pysonar"
uv "xonsh[full]"
npm "@aisuite/chub"
npm "@dbml/cli"
npm "@mariozechner/pi-coding-agent"
npm "@openai/codex"
npm "@razakadam74/gitmsg"
npm "cline"
npm "freebuff"
npm "omniroute"
npm "openskills"
npm "opensrc"
npm "prettier"
